app/views/sections/index.html.erb

      <td><%= section.position %></td>
      <td><%= section.page.name if section.page %></td>
---
SELECT  `pages`.* FROM `pages` WHERE `pages`.`id` = 2 LIMIT 1