app/views/subjects/index.html.erb


  <div><%= pluralize(@subjects.size, 'subject') %> found</div>
---
SELECT COUNT(*) FROM `subjects`
SELECT `subjects`.* FROM `subjects` ORDER BY subjects.position ASC

      <td class="center"><%= status_tag(subject.visible) %></td>
      <td class="center"><%= subject.pages.size %></td>
---
SELECT COUNT(*) FROM `pages` WHERE `pages`.`subject_id` = 1