app/controllers/pages_controller.rb

    def find_subject
      if params[:subject_id]
        @subject = Subject.find(params[:subject_id])
---
SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1