app/controllers/sections_controller.rb

SELECT `pages`.* FROM `pages` ORDER BY position ASC
---
  def new
    @section = Section.new({:name => "Default"})
    @pages = Page.order('position ASC')

SELECT `pages`.* FROM `pages` ORDER BY position ASC
---
  def edit
    @section = Section.find(params[:id])
    @pages = Page.order('position ASC')