app/controllers/sections_controller.rb

  def show
    @section = Section.find(params[:id])
---
SELECT  `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1

  def new
    @section = Section.new({:page_id => @page.id, :name => "Default"})
    @pages = @page.subject.pages.sorted
    @section_count = Section.count + 1
---
SELECT COUNT(*) FROM `sections`

  def create
    @section = Section.new(section_params)
    if @section.save
---
INSERT INTO `sections` (`page_id`, `name`, `position`, `visible`, `content_type`, `content`, `created_at`, `updated_at`) VALUES (3, 'Section 2', 2, 1, 'HTML', ' Example 2', '2017-04-14 17:05:50', '2017-04-14 17:05:50')

  def edit
    @section = Section.find(params[:id])
    @pages = @page.subject.pages.sorted
    @section_count = Section.count
---
SELECT  `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1
SELECT COUNT(*) FROM `sections`

  def update
    @section = Section.find(params[:id])
    if @section.update_attributes(section_params)
---
SELECT  `sections`.* FROM `sections` WHERE `sections`.`id` = 1 LIMIT 1
UPDATE `sections` SET `page_id` = 2, `visible` = 1, `content_type` = 'text', `content` = 'Google', `updated_at` = '2017-04-14 17:05:15' WHERE `sections`.`id` = 1

    def find_page
      if params[:page_id]
        @page = Page.find(params[:page_id])
---
SELECT  `pages`.* FROM `pages` WHERE `pages`.`id` = 3 LIMIT 1