app/controllers/subjects_controller.rb

SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1
---
  def show
    @subject = Subject.find(params[:id])

SELECT COUNT(*) FROM `subjects`
---
  def new
    @subject = Subject.new({:name => "Default"})
    @subject_count = Subject.count + 1

INSERT INTO `subjects` (`name`, `position`, `visible`, `created_at`, `updated_at`) VALUES ('Ruby On Rails', 2, 1, '2017-04-23 00:25:00', '2017-04-23 00:25:31')
SELECT COUNT(*) FROM `subjects`
---
  def create
    # Instantiate a new object using form parameters
    @subject = Subject.new(subject_params)
    # Save the object
    if @subject.save
      # If save succeeds, redirect to the index action
      flash[:notice] = "Subject created successfully."
      redirect_to(:action => 'index')
    else
      # If save fails, redisplay the form so user can fix problems
      @subject_count = Subject.count + 1

SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 1 LIMIT 1
SELECT COUNT(*) FROM `subjects`
---
  def edit
    @subject = Subject.find(params[:id])
    @subject_count = Subject.count

SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 6 LIMIT 1
UPDATE `subjects` SET `created_at` = '2017-04-10 19:25:00', `updated_at` = '2017-04-14 17:16:22' WHERE `subjects`.`id` = 1
SELECT COUNT(*) FROM `subjects`
---
  def update
    # Find an existing object using form parameters
    @subject = Subject.find(params[:id])
    # Update the object
    if @subject.update_attributes(subject_params)
      # If update succeeds, redirect to the index action
      flash[:notice] = "Subject updated successfully."
      redirect_to(:action => 'show', :id => @subject.id)
    else
      # If update fails, redisplay the form so user can fix problems
      @subject_count = Subject.count

SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 6 LIMIT 1
---
  def delete
    @subject = Subject.find(params[:id])

DELETE FROM `subjects` WHERE `subjects`.`id` = 6
SELECT  `subjects`.* FROM `subjects` WHERE `subjects`.`id` = 6 LIMIT 1
---
  def destroy
    subject = Subject.find(params[:id]).destroy